burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_usart.c
    if(flagstatus && intenable){
        temp = SET;
    }else{
        temp = RESET; 
    }
    return temp;
}

/*!
    \brief      clear USART interrupt flag (API_ID(0x004A))
    \param[in]  usart_periph: USARTx(x=0,1,2)
    \param[in]  int_flag: USART interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_PERR: parity error flag
      \arg        USART_INT_FLAG_ERR_FERR: frame error flag
      \arg        USART_INT_FLAG_ERR_NERR: noise detected flag
      \arg        USART_INT_FLAG_RBNE_ORERR: read data buffer not empty interrupt and overrun error flag
      \arg        USART_INT_FLAG_ERR_ORERR: error interrupt and overrun error
      \arg        USART_INT_FLAG_IDLE: idle line detected flag
      \arg        USART_INT_FLAG_TC: transmission complete flag
      \arg        USART_INT_FLAG_LBD: LIN break detected flag
      \arg        USART_INT_FLAG_CTS: CTS change flag
      \arg        USART_INT_FLAG_RT: receiver timeout flag
      \arg        USART_INT_FLAG_EB: end of block flag
      \arg        USART_INT_FLAG_AM: address match flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt and flag
    \param[out] none
    \retval     none
*/
void usart_interrupt_flag_clear(uint32_t usart_periph, usart_interrupt_flag_enum int_flag)
{
    if(USART_INT_FLAG_RFF == int_flag){
        USART_RFCS(usart_periph) &= (uint32_t)(~USART_RFCS_RFFINT);
    }else{
        USART_INTC(usart_periph) |= BIT(USART_BIT_POS2(int_flag));
    }
}
